Revit 2024 API
OptionalFunctionalityUtils.IsPDFImportAvailable Method
 Checks whether PDF import is available in the installed Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2024 because it will always return true. It will be removed in a future version of Revit")]
public static bool IsPDFImportAvailable()
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2024 because it will always return true. It will be removed in a future version of Revit")> _
Public Shared Function IsPDFImportAvailable As Boolean
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2024 because it will always return true. It will be removed in a future version of Revit")]
public:
static bool IsPDFImportAvailable()
Return Value
 True if a PDF import is available in the installed Revit.
Remarks
 PDF Import requires the presence of certain modules that are optional and may not be part of the installed Revit.
See Also
OptionalFunctionalityUtils Class
Autodesk.Revit.DB Namespace